---
kind: property
id: P:Autodesk.Revit.DB.TriangleInShellComponent.VertexIndex1
source: html/7850984b-0f4c-e226-7988-1a1cf01bd630.htm
---
# Autodesk.Revit.DB.TriangleInShellComponent.VertexIndex1 Property

Index of the triangle's second vertex in the TriangulatedShellComponent's array of vertices.

## Syntax (C#)
```csharp
public int VertexIndex1 { get; }
```